In [2]:
import matplotlib.pyplot as plt
import pandas as pd

In [ ]:
#"/Users/amitkumarsahu/Desktop/pandas/tips.csv"

In [6]:
names1880 = pd.read_csv("/Users/amitkumarsahu/Desktop/babynames/yob1880.txt",names=['name', 'sex', 'Name_Number'])
names1880

           name sex  Name_Number
0          Mary   F         7065
1          Anna   F         2604
2          Emma   F         2003
3     Elizabeth   F         1939
4        Minnie   F         1746
...         ...  ..          ...
1995     Woodie   M            5
1996     Worthy   M            5
1997     Wright   M            5
1998       York   M            5
1999  Zachariah   M            5

[2000 rows x 3 columns]

In [7]:
names1880["sex"].value_counts()

M    1058
F     942
Name: sex, dtype: int64

In [8]:
names1880["year"]=1880